app/controllers/filme_controller.rb

	def filmes_locais
		@filmes = Filme.limit(20)
---
SELECT "filmes".* FROM "filmes" LIMIT ?  [["LIMIT", 20]]

	def detalhes_filmes_locais
		@filme = Filme.find(params[:id])
---
SELECT "filmes".* FROM "filmes" WHERE "filmes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]

	def create
		@filme = Filme.new(permit_params)
		if @filme.save
---
INSERT INTO "filmes" ("created_at", "updated_at", "id_filme", "original_title", "overview", "poster_path", "release_date") VALUES (?, ?, ?, ?, ?, ?, ?)

	def editar
		@filme = Filme.find(params[:id])
		if @filme.update(permit_params)
---
SELECT "filmes".* FROM "filmes" WHERE "filmes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "filmes" SET "updated_at" = ?, "original_title" = ?, "release_date" = ? WHERE "filmes"."id" = ?  [["updated_at", "2021-07-01 05:57:21.621201"], ["original_title", "Avengers:  bora flash"], ["release_date", "2019-04-25"], ["id", 1]]

	def destroy
		filme = Filme.find(params[:id])
		if filme.destroy
---
SELECT "filmes".* FROM "filmes" WHERE "filmes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "filmes" WHERE "filmes"."id" = ?  [["id", 17]]

	def mostrar_historico
		@historico = HistoricoBusca.all
---
SELECT "historico_buscas".* FROM "historico_buscas"

	def salva_historico
		@historico = HistoricoBusca.new
		@historico.termo_pesquisa = params[:nome]
		@historico.save
---
INSERT INTO "historico_buscas" ("termo_pesquisa", "created_at", "updated_at") VALUES (?, ?, ?)  [["termo_pesquisa", "mad"], ["created_at", "2021-07-01 08:03:13.756727"], ["updated_at", "2021-07-01 08:03:13.756727"]]