app/models/filme.rb

	def salvar_novos(id_filme, original_title, overview, poster_path, release_date)
		filme = Filme.new
		filme.id_filme = id_filme
		filme.original_title = original_title
		filme.overview = overview
		filme.poster_path = "https://image.tmdb.org/t/p/w500" + poster_path if filme['poster_path'].present?
		filme.release_date = release_date
		filme.save
---
INSERT INTO "filmes" ("created_at", "updated_at", "id_filme", "original_title", "overview") VALUES (?, ?, ?, ?, ?)  [["created_at", "2021-07-01 00:05:09.508034"], ["updated_at", "2021-07-01 00:05:09.508034"], ["id_filme", 340023], ["original_title", "Mad Max: The Wasteland"], ["overview", ""]]

	def existe_no_banco?(id_filme)
			filme = Filme.find_by(id_filme: id_filme)
			if filme.present?
---
SELECT "filmes".* FROM "filmes" WHERE "filmes"."id_filme" = ? LIMIT ?  [["id_filme", 272878], ["LIMIT", 1]]
SELECT "filmes".* FROM "filmes" WHERE "filmes"."id_filme" = ? LIMIT ?  [["id_filme", 299534], ["LIMIT", 1]]